#+TITLE: HDL Practice - Building the NAND gate
#+STARTUP: overview hideblocks indent entitiespretty:
* DONE Extract the compare file from the model (5 min)

1) In the ~Design~ panel of the LogiSim dashboard, right-click on the
   diagram name (=main=) and choose ~Analyze Circuit~.

2) Export the truth table as =Nand.txt= (you can only export into .txt).

3) You have to edit the file before loading it as =Nand.cmp=.
   #+begin_quote
   The file has to have an exact format to work with the hardware
   simulator. Find =Xor.cmp= in the Nand2Tetris ~projects/1~ folder and
   edit the =Nand.txt= file, then save it as =Nand.cmp=.
   #+end_quote

4) Alternatively, you can write a C++ or Python script to create the
   .cmp file (this is faster):
   #+begin_src C++ :cmdline > ~/nand2tetris/projects/mb2/Nand.cmp :main yes :includes <iostream> <fstream> :namespaces std :results none
     ofstream fout("/home/aletheia/nand2tetris/projects/mb2/Nand.cmp");
     fout << "| a | b |out|" << endl;
     for (bool a : {false,true})
       for (bool b : {false,true})
         fout << "| " << a << " | " << b << " | " << !(a && b) << " |" << endl;
     fout.close();
   #+end_src

   #+begin_src bash :results output :exports both
     cd ~/nand2tetris/projects/mb2/
     cat Nand.cmp
   #+end_src

   #+RESULTS:
   : | a | b |out|
   : | 0 | 0 | 1 |
   : | 0 | 1 | 1 |
   : | 1 | 0 | 1 |
   : | 1 | 1 | 0 |

